toy_app/app/views/users/show.html.erb

  <strong>First micropost:</strong>
  <%= @user.microposts.first.content%>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]