sample_app/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["user_id", 1], ["created_at", 2017-01-19 07:14:39 UTC], ["updated_at", 2017-01-19 07:14:39 UTC], ["picture", "Schermafbeelding_2017-01-16_om_10.54.59.png"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save