sample_app/app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$B1I7xgH2k6P6vKBdFsOgE.RvlFT9symZ.SwohrNpltu20s.xmD5zW"], ["updated_at", 2017-01-17 15:39:32 UTC], ["id", 101]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)