sample_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", true], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", true]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])